config/optimisationsSansDeps.org


* Variable and mode built-in

** bases esthétique

#+begin_src emacs-lisp
  ;;basique
  (when window-system
    (progn
      (scroll-bar-mode 0)
      (tool-bar-mode 0))
    )

  (menu-bar-mode 0)
  (tooltip-mode 0)
#+end_src

** Gestion du buffer scratch

*** Message de base à nil

#+begin_src emacs-lisp
  (setq initial-scratch-message nil)
#+end_src

*** Mode de base dans scratch

#+begin_src emacs-lisp
  (defvaralias 'major-mode-for-buffer-scratch 'initial-major-mode)
  (setq major-mode-for-buffer-scratch 'org-mode)
#+end_src

** Fichiers récents sauvegardé 

#+begin_src emacs-lisp

  (use-package recentf
    :config

    (recentf-mode 1)
    (setq recentf-max-menu-items 100)
    (setq recentf-max-saved-items 100)

    ;; fichier à exclure de recentf
    ;; If you use recentf then you might find it convenient to exclude all of the files in the no-littering directories using something like the following.
    (add-to-list 'recentf-exclude no-littering-var-directory)
    (add-to-list 'recentf-exclude no-littering-etc-directory)
    (add-to-list 'recentf-exclude "/tmp/") ;;pour emacs-everywhere notamment
    ;; Exlcude the org-agenda files
    ;; (they flood the recentf because dashboard always checks their content)
    ;; (with-eval-after-load 'org ;;important
    ;; (add-to-list 'recentf-exclude (org-agenda-files))
    ;; )
    )

#+end_src

** Dernière commandes proposé

Cela permet de ré-avoir les commandes faites lors de la dernière session d'emacs.

#+begin_src emacs-lisp 

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :init
    (setq savehist-file (concat user-emacs-directory "var/savehist.el"))
    :config
    (setq history-length 200)
    ;;List of additional variables to save.
    (setq savehist-additional-variables '(kill-ring search-ring recentf-list))
    (savehist-mode t)
    
    ;; pour améliorer les perf ? voir avec Mathieu
    (put 'minibuffer-history 'history-length 50)
    (put 'evil-ex-history 'history-length 50)
    (put 'kill-ring 'history-length 25)
    )

#+end_src
** Gestion des sauvegardes, et fichiers à ne pas mettre dans les backups

#+begin_src emacs-lisp 

  ;;sauvegarde à tout les changement de fenêtre
  (defun xah-save-all-unsaved (&rest args)
    "Save all unsaved files. no ask.
          Version 2019-11-05"
    (interactive)
    (unless (string-equal (file-name-extension buffer-file-name) "gpg")
      (save-some-buffers t))
    )

  ;; mis dans xfk-layer
  ;; (defun cp/xah-fly-save-buffer-if-file-not-gpg ()
  ;; "Save current buffer if it is a file."
  ;; (interactive)
  ;; (when (and (buffer-file-name) (not (string-equal (file-name-extension buffer-file-name) "gpg")))
  ;; (save-buffer)))

  ;; (add-to-list 'window-state-change-functions 'xah-save-all-unsaved)
  ;; sauvegarde automatique avec command mode
  ;; (add-hook 'xah-fly-command-mode-activate-hook 'cp/xah-fly-save-buffer-if-file-not-gpg)

  (setq make-backup-files t	  ; backup of a file the first time it is saved.
        backup-by-copying t	  ; don't clobber symlinks
        version-control t		  ; version numbers for backup files
        delete-old-versions t	  ; delete excess backup files silently
        delete-by-moving-to-trash t ; Put the deleted files in the trash
        kept-old-versions 6 ; oldest versions to keep when a new numbered backup is made (default: 2)
        kept-new-versions 9 ; newest versions to keep when a new numbered backup is made (default: 2)
        auto-save-default t ; auto-save every buffer that visits a file into another file, not the original
        auto-save-timeout 20 ; number of seconds idle time before auto-save (default: 30)
        auto-save-interval 200 ; number of keystrokes between auto-saves (default: 300)
        ;; auto-save-visited-file-name t ;; sauvegarde directement sur le fichier original
        )

  ;;fichier à ne pas copier dans les backups
  (setq auto-mode-alist
        (append
         (list
          '("\\.\\(vcf\\|gpg\\)$" . sensitive-minor-mode))
         auto-mode-alist))

#+end_src
** Permet de r y ou n au lieu de yes ou no 

#+begin_src emacs-lisp

  (fset 'yes-or-no-p 'y-or-n-p)
  
#+end_src
** Rafraichit automatiquement les buffers, sauf si ya eu des moddif évidemment
#+begin_src emacs-lisp 

  (global-auto-revert-mode t)
  

#+end_src

** Ne demande pas de confirme pour certains revert

#+begin_src emacs-lisp
(setq revert-without-query '(".pdf"))
#+end_src

** Échap en une fois
#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src
** Réécriture/remplacement lors de texte sélectionné
#+begin_src emacs-lisp

  (delete-selection-mode t)
  
#+end_src
** Sauvegarde la place du curseur(marche sans no-litteralling)

#+begin_src emacs-lisp

    (save-place-mode 1)

#+end_src

** Dossier de base dans .emacs.d quand on fait un find file

#+begin_src emacs-lisp
  (cd user-emacs-directory)
#+end_src

** Meilleur fonction pour chercher at point

#+begin_src emacs-lisp
  (defun cp/find-symbol ()
    "Find symbol at point or proprose to find a symbol"
    (interactive)
    (let ((symbol
           (or
            ;; (symbol-at-point)
            (helpful--symbol-at-point)
            ;; (intern (completing-read "Symbol: " obarray))
            (helpful--read-symbol
             "Symbol: "
             (helpful--symbol-at-point)
             #'helpful--bound-p))))
      (cond
       ((and (boundp symbol) (fboundp symbol))
        (if (y-or-n-p
             (format "%s is a both a variable and a callable, show variable?"
                     symbol))
            (find-variable symbol)
          (find-function symbol)))

       ((fboundp symbol)
        (find-function symbol))
       ((boundp symbol)
        (find-variable symbol))
       ;; ((condition-case nil
       ;; (find-function-at-point)
       ;; (error nil)) (find-function-at-point))
       ;; ((condition-case nil
       ;; (find-variable-at-point)
       ;; (error nil)) (find-variable-at-point))
       (t (message "no symbol at point or don't find the path")))))



  (defun describe-thing-in-popup ()
    (interactive)
    (let* ((thing (symbol-at-point)))
      (cond
       ((fboundp thing) (describe-in-popup 'describe-function))
       ((boundp thing) (describe-in-popup 'describe-variable)))))

  (defun describe-in-popup (fn)
    (let* ((thing (symbol-at-point))
           (description (save-window-excursion
                          (funcall fn thing)
                          (switch-to-buffer "*Help*")
                          (buffer-string))))
      (popup-tip description
                 :point (point)
                 :around t
                 :height 30
                 :scroll-bar t
                 :margin t)))
#+end_src

** Launch emacs server

I advise you to put in "application at startup" (under linux, I don't know under windows) the command "emacs" to launch emacs at startup

#+begin_src emacs-lisp 

  (server-start)  ;; starts emacs as server (if you didn't already)

#+end_src

** Meilleur navigateur

Ce qui ralenti eww = images, donc la fonction "eww-toggle-images" est parfaite

 • ‘TAB’ - Next link
 • Shift+TAB - Previous link
 • ‘b’ - Add bookmark
 • ‘B’ - View bookmarks
 • ‘d’ - Download link under point
 • ‘l’ - Go back
 • ‘r’ - Go forward
 • ‘H’ - View history
 • ‘g’ - reload the page
 • ‘G’ - Enter a new URL or search
 • ‘R’ - Attempt to improve readability
 • ‘w’ - Copy the current URL
 • M-<RET> - Open link in new tab (eww-open-in-new-buffer)
 • ‘s’ - Get a list of eww tabs (eww-list-buffers)

#+begin_src emacs-lisp 

  ;; en mode readble, plus sympa à lire (provoque un bug, mais pg. corrigé avec une maj ?)
  (add-hook 'eww-after-render-hook 'eww-readable)
  ;; (remove-hook 'eww-after-render-hook 'eww-readable)


  (with-eval-after-load 'xah-fly-keys
    (defun cp/xah-insert-mode-when-command-eww ()
      "Run xah-fly-insert-mode-activate after a search of eww. Don't works with a simple advice-add"
      (when
          ;; (and (> (length (eww-current-url)) (length eww-search-prefix)) ;; pas
          ;;besoin de vérifier si c'est déjà plus grand !
          ;; (string= eww-search-prefix (substring (eww-current-url) 0 (length eww-search-prefix))))
          ;; juste si c'est la même c'est ok
          (not (null (cl-search eww-search-prefix (eww-current-url))))
        (xah-fly-insert-mode-activate)))
    (add-hook 'eww-after-render-hook 'cp/xah-insert-mode-when-command-eww))

  (setq
   eww-search-prefix "https://html.duckduckgo.com/html/?q="
   ;; eww-search-prefix "https://www.bing.com/search?q="
   shr-inhibit-images t  ;;n'affiche pas les images (au début (eww-toggle-images))
   eww-restore-desktop t ;; rafraîchit automatiquement
   eww-desktop-remove-duplicates t
   shr-use-colors nil
   shr-bullet "• "
   shr-folding-mode t
   shr-indentation 2  ; Left-side margin
   shr-width 70       ; Fold text to 70 columns
   shr-use-colors nil ; No colours
   url-privacy-level '(email agent cookies lastloc))

  ;; change automatiquement le nom
  (when (fboundp 'eww)
    (defun xah-rename-eww-buffer ()
      "Rename `eww-mode' buffer so sites open in new page.
            URL `http://xahlee.info/emacs/emacs/emacs_eww_web_browser.html'
            Version 2017-11-10"
      (let (($title (plist-get eww-data :title)))
        (when (eq major-mode 'eww-mode)
          (if $title
              (rename-buffer (concat "eww " $title) t)
            (rename-buffer "eww" t)))))
    (add-hook 'eww-after-render-hook 'xah-rename-eww-buffer))

#+end_src

* Interface Enhancement
** Editing
*** Pour bouger les lignes/paragraphe comme dans org (avec CTRL)

Utiliser les fonctions de xah ?

#+begin_src emacs-lisp 

(use-package move-text
     :defer 0.5
     :config
     (move-text-default-bindings))

#+end_src
*** Faire des extension de la région sélectionnée.

#+begin_src emacs-lisp
  (use-package expand-region
    :config
    (setq expand-region-show-usage-message nil))
#+end_src

