config/optimisationsSansDeps.el
;;basique
(when window-system
  (progn
    (scroll-bar-mode 0)
    (tool-bar-mode 0))
  )

(menu-bar-mode 0)
(tooltip-mode 0)

(setq initial-scratch-message nil)

(defvaralias 'major-mode-for-buffer-scratch 'initial-major-mode)
(setq major-mode-for-buffer-scratch 'org-mode)

(use-package recentf
  :config

  (recentf-mode 1)
  (setq recentf-max-menu-items 100)
  (setq recentf-max-saved-items 100)

  ;; fichier à exclure de recentf
  ;; If you use recentf then you might find it convenient to exclude all of the files in the no-littering directories using something like the following.
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory)
  (add-to-list 'recentf-exclude "/tmp/") ;;pour emacs-everywhere notamment
  ;; Exlcude the org-agenda files
  ;; (they flood the recentf because dashboard always checks their content)
  ;; (with-eval-after-load 'org ;;important
  ;; (add-to-list 'recentf-exclude (org-agenda-files))
  ;; )
  )

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (setq savehist-file (concat user-emacs-directory "var/savehist.el"))
  :config
  (setq history-length 200)
  ;;List of additional variables to save.
  (setq savehist-additional-variables '(kill-ring search-ring recentf-list))
  (savehist-mode t)

  ;; pour améliorer les perf ? voir avec Mathieu
  (put 'minibuffer-history 'history-length 50)
  (put 'evil-ex-history 'history-length 50)
  (put 'kill-ring 'history-length 25)
  )

;;sauvegarde à tout les changement de fenêtre
(defun xah-save-all-unsaved (&rest args)
  "Save all unsaved files. no ask.
        Version 2019-11-05"
  (interactive)
  (unless (string-equal (file-name-extension buffer-file-name) "gpg")
    (save-some-buffers t))
  )

(defun cp/xah-fly-save-buffer-if-file-not-gpg ()
  "Save current buffer if it is a file."
  (interactive)
  (when (and (buffer-file-name) (not (string-equal (file-name-extension buffer-file-name) "gpg")))
    (save-buffer)))

;; (add-to-list 'window-state-change-functions 'xah-save-all-unsaved)
;; sauvegarde automatique avec command mode
(add-hook 'xah-fly-command-mode-activate-hook 'cp/xah-fly-save-buffer-if-file-not-gpg)

(setq make-backup-files t	; backup of a file the first time it is saved.
      backup-by-copying t	; don't clobber symlinks
      version-control t		; version numbers for backup files
      delete-old-versions t	; delete excess backup files silently
      delete-by-moving-to-trash t ; Put the deleted files in the trash
      kept-old-versions 6 ; oldest versions to keep when a new numbered backup is made (default: 2)
      kept-new-versions 9 ; newest versions to keep when a new numbered backup is made (default: 2)
      auto-save-default t ; auto-save every buffer that visits a file into another file, not the original
      auto-save-timeout 20 ; number of seconds idle time before auto-save (default: 30)
      auto-save-interval 200 ; number of keystrokes between auto-saves (default: 300)
      ;; auto-save-visited-file-name t ;; sauvegarde directement sur le fichier original
      )

;;fichier à ne pas copier dans les backups
(setq auto-mode-alist
      (append
       (list
        '("\\.\\(vcf\\|gpg\\)$" . sensitive-minor-mode))
       auto-mode-alist))

(fset 'yes-or-no-p 'y-or-n-p)

(global-auto-revert-mode t)

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(delete-selection-mode t)

(save-place-mode 1)

(cd user-emacs-directory)

(defun cp/find-symbol-at-point ()
  "DOCSTRING"
  (interactive)
  (let ((symbol (symbol-at-point)))
    (cond
     ((and (boundp symbol) (fboundp symbol))
      (if (y-or-n-p
           (format "%s is a both a variable and a callable, show variable?"
                   symbol))
          (find-variable symbol)
        (find-function symbol)))

     ((fboundp symbol)
      (find-function symbol))
     ((boundp symbol)
      (find-variable symbol))
     ;; ((condition-case nil
     ;; (find-function-at-point)
     ;; (error nil)) (find-function-at-point))
     ;; ((condition-case nil
     ;; (find-variable-at-point)
     ;; (error nil)) (find-variable-at-point))
     (t (message "no symbol at point or don't find the path"))
     ))
  )



(defun describe-thing-in-popup ()
  (interactive)
  (let* ((thing (symbol-at-point)))
    (cond
     ((fboundp thing) (describe-in-popup 'describe-function))
     ((boundp thing) (describe-in-popup 'describe-variable)))))

(defun describe-in-popup (fn)
  (let* ((thing (symbol-at-point))
         (description (save-window-excursion
                        (funcall fn thing)
                        (switch-to-buffer "*Help*")
                        (buffer-string))))
    (popup-tip description
               :point (point)
               :around t
               :height 30
               :scroll-bar t
               :margin t)))

(server-start)  ;; starts emacs as server (if you didn't already)

(use-package move-text
     :defer 0.5
     :config
     (move-text-default-bindings))

(use-package expand-region)
