config/optimisationsSansDeps.org
*** Better kill ring

#+begin_src emacs-lisp 

  (use-package popup-kill-ring
    :config
    (with-eval-after-load 'company

      ;; touches perso, 
      (define-key popup-kill-ring-keymap (kbd "C-n") nil)
      (define-key popup-kill-ring-keymap (kbd "C-p") nil)
      (define-key popup-kill-ring-keymap (kbd "s") #'popup-kill-ring-next)
      (define-key popup-kill-ring-keymap (kbd "d") #'popup-kill-ring-previous)
      (define-key popup-kill-ring-keymap (kbd "u") 'popup-kill-ring-select)
      (define-key popup-kill-ring-keymap (kbd "SPC") #'company-abort)
      )
    (define-key popup-menu-keymap (kbd "s") #'popup-kill-ring-next)



    )

#+end_src

*** Pour faire des delete intelligent

Supprimer les espaces entre les mots, les parenthèses et autres délimiteurs de manière intelligente (ou stupide).
Voir la doc pour plus customisations

#+begin_src emacs-lisp :tangle no

  (use-package smart-hungry-delete
    :bind (
	   ("<backspace>" . smart-hungry-delete-backward-char)
	   ;; ("C-d" . smart-hungry-delete-forward-char)
	   )
    :defer nil ;; dont defer so we can add our functions to hooks 
    :config (smart-hungry-delete-add-default-hooks)
    )

#+end_src

*** Parenthèse et <> autres auto, pour modifier pair de parenthèse


Doc : https://github.com/Fuco1/smartparens et [[https://smartparens.readthedocs.io/en/latest/ ][ici]]

#+begin_src emacs-lisp

    (use-package smartparens
      ;; :after lsp
    :hook ((lsp-mode text-mode emacs-lisp-mode scheme-mode) . smartparens-mode)
    :config
    (sp-pair "\«" "\»")
    ;;pour enlever un truc
    ;; the second argument is the closing delimiter, so you need to skip it with nil

    ;;    (sp-pair "'" nil :actions :rem)

    ;; (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
    ;; (sp-local-pair 'xah-elisp-mode "'" nil :actions nil)
    ;; (sp-local-pair 'emacs-lisp-mode "`" nil :actions nil)
    ;; (sp-local-pair 'xah-elisp-mode "`" nil :actions nil)
    (sp-local-pair 'scheme-mode "'" nil :actions nil)

    (defun cp/remove-local-pair-for-emacs-lisp-mode ()
      "Obligé de créer cette fonction, car pour prendre les même hook que emacs-lisp-mode pour xah-lisp-mode, pas de fonction lambda"
      (sp-local-pair major-mode "`" nil :actions nil)
      (sp-local-pair major-mode "'" nil :actions nil))

    (add-hook 'emacs-lisp-mode-hook 'cp/remove-local-pair-for-emacs-lisp-mode)

    (add-hook 'org-mode-hook 'cp/remove-local-pair-for-emacs-lisp-mode)

    ;; pour rajouter à un mode :
    ;; pas supprimer avec xah car ne fait pas partie de xah-right-brackets
    ;; changer org emphasis ?

    ;; (sp-local-pair 'org-mode "*" "*") ;; adds * as a local pair in org mode

    ;; (sp-local-pair 'org-mode "=" "=") ;; adds = as a local pair in org mode

    ;; (sp-local-pair 'org-mode "\/" "\/")
    )

#+end_src

*** Pour éditer les choses en root

#+begin_src emacs-lisp
  (use-package sudo-edit)
#+end_src

** Navigation
*** Consult


#+begin_src emacs-lisp

    (use-package consult
    :config

    ;; ordre dans la commande consult-buffer
    (setq consult-buffer-sources
          '(consult--source-hidden-buffer
            consult--source-modified-buffer
            consult--source-buffer
            consult--source-bookmark
            consult--source-recent-file
            consult--source-file-register
            consult--source-project-buffer
            consult--source-project-recent-file))

    (setq completion-in-region-function #'consult-completion-in-region)

    ;; Définition de mes fonctions
    (defun cp/consult-line-or-with-word ()
      "Call `consult-line' on current word or text selection.
                      “word” here is A to Z, a to z, and hyphen 「-」 and underline 「_」, independent of syntax table.
                      URL `http://xahlee.info/emacs/emacs/modernization_isearch.html'
                      Version 2015-04-09"
      (interactive)
      (let ($p1 $p2)
        (if (use-region-p)
            (progn
              (setq $p1 (region-beginning))
              (setq $p2 (region-end)))
          (save-excursion
            (setq $p1 (point))
            (setq $p2 (point))))
        (setq mark-active nil)
        (when (< $p1 (point))
          (goto-char $p1))
        (consult-line (buffer-substring-no-properties $p1 $p2))))
  
    ;; au final cela pas ouf, car je suis obligé de passer par le mini-buffer. En plus, activé grâce à universal argument + consult-ripgrep
    (defun cp/consult-ripgrep-with-directory (&optional dir)
      (interactive)
      (consult-ripgrep (or dir (read-directory-name "Directory:")))))

#+end_src

;; peut marcher aussi : 
(defun cp/consult-line-or-with-word (&optional initial)
      (interactive (progn
                     (if (use-region-p)
                         (progn
                           (setq $p1 (region-beginning))
                           (setq $p2 (region-end)))
                       (save-excursion
                         (setq $p1 (point))
                         (setq $p2 (point))))
                     (list (buffer-substring-no-properties $p1 $p2))
                     )
                   )
      (consult-line initial)
      )

*** Pour jump sur un endroit sur la fenêtre d'emacs

#+begin_src emacs-lisp 

  (use-package avy
    ;;\ pour l'espace
    :custom
    ;;personnalition des touches, important
    ;; (avy-keys '(?a ?u ?e ?i ?t ?s ?r ?n ?\ ?\^M)) ;;^M=enter
    (avy-keys '(?a ?u ?e ?i ?t ?s ?r ?n ?\ ))
    (avy-background t)
    ;;nouvelle touches pour escape avy go timer
    (avy-escape-chars '(?\e ?\M-g))
    :config
    (setq avy-timeout-seconds 0.25)

    ;; pour que ça marche sur toutse les fenêtres
    (setq avy-all-windows 'all-frames)

    ;;personnaliser chaque commande :
    ;; (setq avy-keys-alist
    ;; `((avy-goto-char . ,(number-sequence ?a ?f))
    ;; (avy-goto-word-1 . (?f ?g ?h ?j))))

    (defun avy-goto-char-timer-end (&optional arg)
      "Read one or many consecutive chars and jump to the last one.
  The window scope is determined by `avy-all-windows' (ARG negates it)."
      (interactive "P")
      (avy-goto-char-timer arg)
      (forward-char (length avy-text)))



    )



#+end_src

*** Pour jump sur les liens (bind sur O en général) 

#+begin_src emacs-lisp
  (use-package ace-link
    :config
    (ace-link-setup-default))
#+end_src

*** Pour jump à un endroit après X fois la commande

:scope 'page pour tous !

#+begin_src emacs-lisp
  (use-package holymotion
    :straight (holymotion :type git
                          :host github
                          :repo "Overdr0ne/holymotion"
                          :branch "main")
    :config
    ;; define some custom motions, I'm using smartparens here
    (holymotion-make-motion
     holymotion-xah-forward-right-bracket #'xah-forward-right-bracket)
    (holymotion-make-motion
     holymotion-xah-backward-left-bracket #'xah-backward-left-bracket)

    (defun holymotion-next-line-only-with-prefix ()
      "DOCSTRING here"
      (interactive)
      (if current-prefix-arg
          (holymotion-next-line)
        (next-line))))
#+end_src



***** Le bon vieux ctrlf, mais optimisé par emacs

#+begin_src emacs-lisp :tangle no
  (use-package ctrlf
    :config
    (define-key ctrlf-mode-map [remap next-line] #'ctrlf-next-match)
    (define-key ctrlf-mode-map [remap previous-line] #'ctrlf-previous-match))

#+end_src

***** Visiter les fichiers corbeille Emacs

#+begin_src emacs-lisp
(use-package trashed)
#+end_src


**** Visualize
    
Packages in this section are usable for editing.

***** Affichage des touches

#+begin_src emacs-lisp

  (use-package which-key
    ;; :diminish which-key-mode
    :config
    ;;activer which-key
    (which-key-mode)
    ;;temps avant déclenchement de wich-key minimum
    (setq which-key-idle-delay 0.01)
    ;; affichage sur le côté, mais si marche pas en bas
    (which-key-setup-side-window-right-bottom)
    (setq which-key-frame-max-height 100)
    (setq which-key-min-display-lines 1000))


#+end_src

***** Texte

***** Ligne
****** Les lignes reviennent à la ligne (lol) + les paragraphes se mettent correctement

#+begin_src emacs-lisp 

  ;;retour à la ligne concrètrement 
  ;; (add-hook 'text-mode-hook 'turn-on-auto-fill)

  (add-hook 'prog-mode-hook 'turn-on-auto-fill)
  (setq-default fill-column 80)

  ;; taille pour coder
  ;; (add-hook 'prog-mode-hook
  ;; (lambda ()
  ;; (setq fill-column 80)
  ;; (auto-fill-mode t)
  ;; )
  ;; )

  ;; visuellement
  (global-visual-line-mode 1)

  ;; paragraphe
  ;; (refill-mode)

#+end_src

****** Tailles des interlignes

merci encore à xah, [[http://ergoemacs.org/emacs/emacs_toggle_line_spacing.html][site de la fonction]]
  
#+begin_src emacs-lisp

  (defun taille-interligne ()
    "Toggle line spacing between no extra space to extra half line height.
  URL `http://ergoemacs.org/emacs/emacs_toggle_line_spacing.html'
  Version 2017-06-02"
    (interactive)
    (if line-spacing
	(setq line-spacing nil)
      (setq line-spacing 0.5))
    (redraw-frame (selected-frame)))

#+end_src

****** Afficher le numéro des lignes relativement + quand on les affiches
CLOSED: [2022-04-10 Sun 23:00]

#+begin_src emacs-lisp

  (defun numéro-des-lignes-relatif ()
      (interactive)
      (setq display-line-numbers 'relative)
      )

  (add-hook 'prog-mode-hook #'numéro-des-lignes-relatif)
  ;; (add-hook 'org-mode-hook #'numéro-des-lignes-relatif)

#+end_src

***** Curseur
****** Trainée de lumière pour pas perdre le curseur, désactiver consomme toute la ram

#+begin_src emacs-lisp :tangle no

  (use-package beacon
    :config
    (setq beacon-blink-delay 0.0)
    (setq beacon-blink-duration 0.5)
    (setq beacon-size 20)
    (setq beacon-color "red")
    (beacon-mode 1)
    )


 #+end_src


 
