config/optimisationsSansDeps.el

(use-package popup-kill-ring
  :config
  (with-eval-after-load 'company

    ;; touches perso, 
    (define-key popup-kill-ring-keymap (kbd "C-n") nil)
    (define-key popup-kill-ring-keymap (kbd "C-p") nil)
    (define-key popup-kill-ring-keymap (kbd "s") #'popup-kill-ring-next)
    (define-key popup-kill-ring-keymap (kbd "d") #'popup-kill-ring-previous)
    (define-key popup-kill-ring-keymap (kbd "u") 'popup-kill-ring-select)
    (define-key popup-kill-ring-keymap (kbd "SPC") #'company-abort)
    )
  (define-key popup-menu-keymap (kbd "s") #'popup-kill-ring-next)



  )

(use-package smartparens
  ;; :after lsp
  :hook ((lsp-mode text-mode emacs-lisp-mode scheme-mode) . smartparens-mode)
  :config
  (sp-pair "\«" "\»")
  ;;pour enlever un truc
  ;; the second argument is the closing delimiter, so you need to skip it with nil

  ;;    (sp-pair "'" nil :actions :rem)

  ;; (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
  ;; (sp-local-pair 'xah-elisp-mode "'" nil :actions nil)
  ;; (sp-local-pair 'emacs-lisp-mode "`" nil :actions nil)
  ;; (sp-local-pair 'xah-elisp-mode "`" nil :actions nil)

  (defun cp/remove-local-pair-for-emacs-lisp-mode ()
    "Obligé de créer cette fonction, car pour prendre les même hook que emacs-lisp-mode pour xah-lisp-mode, pas de fonction lambda"
    (sp-local-pair major-mode "`" nil :actions nil)
    (sp-local-pair major-mode "'" nil :actions nil))

  (add-hook 'emacs-lisp-mode-hook 'cp/remove-local-pair-for-emacs-lisp-mode)

  (add-hook 'org-mode-hook 'cp/remove-local-pair-for-emacs-lisp-mode)

  ;; pour rajouter à un mode :
  ;; pas supprimer avec xah car ne fait pas partie de xah-right-brackets
  ;; changer org emphasis ?

  ;; (sp-local-pair 'org-mode "*" "*") ;; adds * as a local pair in org mode

  ;; (sp-local-pair 'org-mode "=" "=") ;; adds = as a local pair in org mode

  ;; (sp-local-pair 'org-mode "\/" "\/")
  )

(use-package sudo-edit)

(use-package consult
  :config
  (setq completion-in-region-function #'consult-completion-in-region)

  ;; Définition de mes fonctions
  (defun cp/consult-line-or-with-word ()
    "Call `consult-line' on current word or text selection.
                “word” here is A to Z, a to z, and hyphen 「-」 and underline 「_」, independent of syntax table.
                URL `http://xahlee.info/emacs/emacs/modernization_isearch.html'
                Version 2015-04-09"
    (interactive)
    (let ($p1 $p2)
      (if (use-region-p)
          (progn
            (setq $p1 (region-beginning))
            (setq $p2 (region-end)))
        (save-excursion
          (setq $p1 (point))
          (setq $p2 (point))))
      (setq mark-active nil)
      (when (< $p1 (point))
        (goto-char $p1))
      (consult-line (buffer-substring-no-properties $p1 $p2))))

  (defun cp/consult-ripgrep-with-directory (&optional dir)
    (interactive)
    (consult-ripgrep (or dir (read-directory-name "Directory:")))
    )
  )

(use-package avy
  ;;\ pour l'espace
  :custom
  ;;personnalition des touches, important
  ;; (avy-keys '(?a ?u ?e ?i ?t ?s ?r ?n ?\ ?\^M)) ;;^M=enter
  (avy-keys '(?a ?u ?e ?i ?t ?s ?r ?n ?\ ))
  (avy-background t)
  ;;nouvelle touches pour escape avy go timer
  (avy-escape-chars '(?\e ?\M-g))
  :config
  (setq avy-timeout-seconds 0.25)

  ;; pour que ça marche sur toutse les fenêtres
  (setq avy-all-windows 'all-frames)

  ;;personnaliser chaque commande :
  ;; (setq avy-keys-alist
  ;; `((avy-goto-char . ,(number-sequence ?a ?f))
  ;; (avy-goto-word-1 . (?f ?g ?h ?j))))

  (defun avy-goto-char-timer-end (&optional arg)
    "Read one or many consecutive chars and jump to the last one.
The window scope is determined by `avy-all-windows' (ARG negates it)."
    (interactive "P")
    (avy-goto-char-timer arg)
    (forward-char (length avy-text)))



  )

(use-package trashed)

(use-package which-key
  ;; :diminish which-key-mode
  :config
  ;;activer which-key
  (which-key-mode)
  ;;temps avant déclenchement de wich-key minimum
  (setq which-key-idle-delay 0.01)
  ;; affichage sur le côté, mais si marche pas en bas
  (which-key-setup-side-window-right-bottom)
  )

;;retour à la ligne concrètrement 
;; (add-hook 'text-mode-hook 'turn-on-auto-fill)

(add-hook 'prog-mode-hook 'turn-on-auto-fill)
(setq-default fill-column 80)

;; taille pour coder
;; (add-hook 'prog-mode-hook
;; (lambda ()
;; (setq fill-column 80)
;; (auto-fill-mode t)
;; )
;; )

;; visuellement
(global-visual-line-mode 1)

;; paragraphe
;; (refill-mode)

(defun taille-interligne ()
  "Toggle line spacing between no extra space to extra half line height.
URL `http://ergoemacs.org/emacs/emacs_toggle_line_spacing.html'
Version 2017-06-02"
  (interactive)
  (if line-spacing
      (setq line-spacing nil)
    (setq line-spacing 0.5))
  (redraw-frame (selected-frame)))

(defun numéro-des-lignes-relatif ()
    (interactive)
    (setq display-line-numbers 'relative)
    )

(add-hook 'prog-mode-hook #'numéro-des-lignes-relatif)
;; (add-hook 'org-mode-hook #'numéro-des-lignes-relatif)
