config/optimisationsSansDeps.org
****** Trainée de lumière sur la ligne à certains moment

#+begin_src emacs-lisp :tangle no

  (use-package pulsar
    :config
    (setq pulsar-pulse-functions
          ;; fonction qui active l'effet
          ;; NOTE 2022-04-09: The commented out functions are from before
          ;; the introduction of `pulsar-pulse-on-window-change'.  Try that
          ;; instead.
          '(recenter-top-bottom
            move-to-window-line-top-bottom
            reposition-window
            bookmark-jump
            other-window
            delete-window
            delete-other-windows
            forward-page
            backward-page
            scroll-up-command
            scroll-down-command
            ;; windmove-right
            ;; windmove-left
            ;; windmove-up
            ;; windmove-down
            ;; windmove-swap-states-right
            ;; windmove-swap-states-left
            ;; windmove-swap-states-up
            ;; windmove-swap-states-down
            ;; tab-new
            ;; tab-close
            ;; tab-next
            org-next-visible-heading
            org-previous-visible-heading
            org-forward-heading-same-level
            org-backward-heading-same-level
            outline-backward-same-level
            outline-forward-same-level
            outline-next-visible-heading
            outline-previous-visible-heading
            outline-up-heading))

    (setq pulsar-pulse-on-window-change t)
    (setq pulsar-pulse t)
    (setq pulsar-delay 0.02)
    (setq pulsar-iterations 30)
    (setq pulsar-face 'pulsar-cyan)
    ;; (setq pulsar-highlight-face 'pulsar-gray)

    (pulsar-global-mode 1)

    ;; OR use the local mode for select mode hooks
    ;; (dolist (hook '(org-mode-hook emacs-lisp-mode-hook))
    ;; (add-hook hook #'pulsar-mode))

    ;; pulsar does not define any key bindings.  This is just a sample that
    ;; respects the key binding conventions.  Evaluate:
    ;;
    ;;     (info "(elisp) Key Binding Conventions")
    ;;
    ;; The author uses C-x l for `pulsar-pulse-line' and C-x L for
    ;; `pulsar-highlight-line'.
    ;;
    ;; You can replace `pulsar-highlight-line' with the command
    ;; `pulsar-highlight-dwim'.
    ;; (let ((map global-map))
    ;; (define-key map (kbd "C-c h p") #'pulsar-pulse-line)
    ;; (define-key map (kbd "C-c h h") #'pulsar-highlight-line)
    ;;   )

    ;; integration with the `consult' package, pas besoin mais pour le test:
    ;; (add-hook 'consult-after-jump-hook #'pulsar-recenter-top)
    ;; (add-hook 'consult-after-jump-hook #'pulsar-reveal-entry)

    )



#+end_src

****** Surlignage ligne du curseur
#+begin_src emacs-lisp
 (global-hl-line-mode t)
 (set-face-background hl-line-face "#311")
#+end_src
***** La barre en bas


#+begin_src emacs-lisp

  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode)
    :custom    
    (doom-modeline-height 25)
    (doom-modeline-bar-width 1)
    (doom-modeline-icon t)
    (doom-modeline-major-mode-icon t)
    (doom-modeline-major-mode-color-icon t)
    (doom-modeline-buffer-file-name-style 'truncate-upto-project)
    (doom-modeline-buffer-state-icon t)
    (doom-modeline-buffer-modification-icon t)
    (doom-modeline-minor-modes nil)
    ;;fait chauffer emacs, désactivé
    (doom-modeline-enable-word-count nil)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-indent-info nil)
    (doom-modeline-checker-simple-format t)
    (doom-modeline-vcs-max-length 20)
    (doom-modeline-env-version t)
    (doom-modeline-irc-stylize 'identity)
    (doom-modeline-github-timer nil)
    (doom-modeline-gnus-timer nil)
    )

#+end_src
***** Buffer cursor indicator
****** nyan cat
#+begin_src emacs-lisp
  (use-package nyan-mode
    :config
    (nyan-mode)
    )
#+end_src
****** Pokemon
  
#+begin_src emacs-lisp :tangle no
  (use-package poke-line
    :config
    (poke-line-global-mode 1)
    (poke-line-set-random-pokemon)
    ;; (setq-default poke-line-pokemon "gengar")
    )
#+end_src
****** Barre côté

#+begin_src emacs-lisp :tangle no
  (use-package yascroll
    :custom (yascroll:delay-to-hide 100000)
    (yascroll:priority 20)
    :config
    (global-yascroll-bar-mode 1))
#+end_src


***** Se mettre en mode "focus"

#+begin_src emacs-lisp

  (use-package darkroom
    ;; :hook (org-mode . darkroom-tentative-mode)
    :commands darkroom-mode
    :config
    (setq darkroom-text-scale-increase 0))



  ;;pour que les fonction marche du 1er coup, activé désactivé.
  ;; (darkroom-mode 1)
  ;; (darkroom-mode 0)

  (defun dw/enter-focus-mode ()

    (darkroom-mode 1)
    (menu-bar-mode 0)
    (scroll-bar-mode 0 )
    (toggle-frame-fullscreen)
    )

  (defun dw/leave-focus-mode ()

    (darkroom-mode 0)
    ;; (menu-bar-mode 1)
    (scroll-bar-mode 1 )
    (toggle-frame-fullscreen)
    )

  (defun dw/toggle-focus-mode ()
    (interactive)
    (if (symbol-value darkroom-mode)
        (dw/leave-focus-mode)
      (dw/enter-focus-mode)))

  ;; (add-hook 'org-mode-hook #'dw/toggle-focus-modebis)
#+end_src

**** Aesthetics of Emacs

***** TODO Police et taille

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :height 130)

  ;;police de base, mise dans le early-init.el pour démarrage plus rapide
  (defun Policedebase ()
    (interactive)
    (set-face-attribute 'default nil
                        :font "Fira Mono"
                        :weight 'light
                        :height 120
                        )
    )
  (defun Policepourcoder ()
    (interactive)
    (set-face-attribute 'default nil
                        :font "JetBrains Mono"
                        :weight 'light
                        ;; :height 150
                        )
    )
  ;;police pour coder
  ;; (add-hook 'lsp-mode-hook 'Policepourcoder)

#+end_src

***** Les jolies icônes

#+begin_src emacs-lisp

  (use-package all-the-icons
    :init
    (unless (member "all-the-icons" (font-family-list))
      (all-the-icons-install-fonts t))
    :if (display-graphic-p)
    :config
    (unless (member "all-the-icons" (font-family-list))
      (all-the-icons-install-fonts t))
    )

  ;;pour les icônes dans dired
  (use-package all-the-icons-dired)

#+end_src

***** Thèmes 

#+begin_src emacs-lisp

  (use-package doom-themes
    :config
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;; for treemacs
    (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    ;;load the theme
    (load-theme 'doom-moonlight t)
    )



  ;;charger le thème lors d'un client emacs :
  (defvar display-theme-loadedp nil)
  (defun load-display-theme ()
    (load-theme 'doom-moonlight t))
  (add-hook 'after-make-frame-functions (lambda (frame)
                                          (unless display-theme-loadedp
                                            (with-selected-frame frame
                                              (load-display-theme))
                                            (setq display-theme-loadedp t))))

  (defun mb/pick-color-theme (frame)
    (select-frame frame)
    (enable-theme 'doom-moonlight))
  (add-hook 'after-make-frame-functions 'mb/pick-color-theme)

#+end_src

***** Mise en valeur du buffer actif (diminue la luminosité)
#+begin_src emacs-lisp

  (use-package dimmer
    :custom
    (dimmer-fraction 0.3)
    (dimmer-exclusion-regexp-list
     '(".*Minibuf.*"
       ".*which-key.*"
       ".*LV.*"))
    :config
    (dimmer-mode 1)
    )

#+end_src

***** Smiley !

#+begin_src emacs-lisp  :tangle no
  (use-package emojify
    :hook (after-init . global-emojify-mode)
    )
#+end_src

***** TODO Très joli icône ! voir ce qui le désactive (je pense j'utiliserai pas)
#+begin_src emacs-lisp :tangle no
  (use-package svg-lib
    :config

    (defvar svg-font-lock-keywords
      `(("TODO"
         (0 (list 'face nil 'display (svg-font-lock-todo))))
        ("NEXT"
         (0 (list 'face nil 'display (svg-font-lock-next))))
        ("TODO"
         (0 (list 'face nil 'display (svg-font-lock-todo))))
        ("\\:\\([0-9a-zA-Z]+\\)\\:"
         (0 (list 'face nil 'display (svg-font-lock-tag (match-string 1)))))
        ("DONE"
         (0 (list 'face nil 'display (svg-font-lock-done))))
        ("\\[\\([0-9]\\{1,3\\}\\)%\\]"
         (0 (list 'face nil 'display (svg-font-lock-progress_percent (match-string 1)))))
        ("\\[\\([0-9]+/[0-9]+\\)\\]"
         (0 (list 'face nil 'display (svg-font-lock-progress_count (match-string 1)))))))

    (defun svg-font-lock-tag (label)
      (svg-lib-tag label nil :margin 0))

    (defun svg-font-lock-todo ()
      (svg-lib-tag "TODO" nil :margin 0
                   :font-family "Fira Mono" :font-weight 500
                   :foreground "#FFFFFF" :background "#673AB7"))


    (defun svg-font-lock-next ()
      (svg-lib-tag "NEXT" nil :margin 0
                   :font-family "Fira Mono" :font-weight 500
                   :foreground "red" :background "#673AB7"))

    (defun svg-font-lock-done ()
      (svg-lib-tag "DONE" nil :margin 0
                   :font-family "Fira Mono" :font-weight 400
                   :foreground "#B0BEC5" :background "white"))

    (defun svg-font-lock-progress_percent (value)
      (svg-image (svg-lib-concat
                  (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                        nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 12)
                  (svg-lib-tag (concat value "%")
                               nil :stroke 0 :margin 0)) :ascent 'center))

    (defun svg-font-lock-progress_count (value)
      (let* ((seq (mapcar #'string-to-number (split-string value "/")))
             (count (float (car seq)))
             (total (float (cadr seq))))
        (svg-image (svg-lib-concat
                    (svg-lib-progress-bar (/ count total) nil
                                          :margin 0 :stroke 2 :radius 3 :padding 2 :width 12)
                    (svg-lib-tag value nil
                                 :stroke 0 :margin 0)) :ascent 'center)))

    ;; Activate
    (push 'display font-lock-extra-managed-props)
    (font-lock-add-keywords nil svg-font-lock-keywords)
    (font-lock-flush (point-min) (point-max))

    ;; Deactivate 
    ;; (font-lock-remove-keywords nil svg-font-lock-keywords)
    ;; (font-lock-flush (point-min) (point-max))

    ;;qqch dans org désactive svg, je dois donc le hook comme ceci pour que ça marche
    (defun svg-icones ()
      (push 'display font-lock-extra-managed-props)
      (font-lock-add-keywords nil svg-font-lock-keywords)
      (font-lock-flush (point-min) (point-max))
      )

    (add-hook #'org-mode-hook #'svg-icones)

    )

#+end_src


***** Emacs transparent

#+begin_src emacs-lisp

  ;; Toggles background transparency
  (defun toggle-transparency ()
    (interactive)
    (let ((alpha (frame-parameter nil 'alpha)))
      (set-frame-parameter
       nil 'alpha
       (if (eql (cond ((numberp alpha) alpha)
                      ((numberp (cdr alpha)) (cdr alpha))
                      ;; Also handle undocumented (<active> <inactive>) form.
                      ((numberp (cadr alpha)) (cadr alpha)))
                100)
           '(85 . 50) '(100 . 100)))))

  ;; (global-set-key (kbd "C-c t") 'toggle-transparency)


  (setq transparency_level 0)
  (defun cp/toggle-transparency ()
    "Toggles transparency of Emacs between 3 settings (none, mild, moderate)."
    (interactive)
    (if (equal transparency_level 0)
        (progn (set-frame-parameter (selected-frame) 'alpha '(85 . 85))
               (setq transparency_level 1))
      (if (equal transparency_level 1)
          (progn (set-frame-parameter (selected-frame) 'alpha '(70 . 85))
                 (setq transparency_level 2))
        (if (equal transparency_level 2)
            (progn (set-frame-parameter (selected-frame) 'alpha '(100 . 85))
                   (setq transparency_level 0)))
        )))
  (define-key global-map (kbd "C-c t") 'cp/toggle-transparency)

  (defun cp/toggle-transparency2 ()
    (interactive)
    (let ((alpha (frame-parameter nil 'alpha)))
      (if (eq
           (if (numberp alpha)
               alpha
             (cdr alpha)) ; may also be nil
           100)
          (set-frame-parameter nil 'alpha '(60 . 50))
        (set-frame-parameter nil 'alpha '(100 . 100)))))

#+end_src


***** Cacher la mode-line


#+begin_src emacs-lisp
    (use-package hide-mode-line)
#+end_src


**** Minibuffer
[[https://github.com/minad/vertico][Vertico]] and friends provides a minimalistic vertical completion UI, which is based on the default completion system.
***** Other
****** Pour faire des commandes dans le mini-buffer

#+begin_src emacs-lisp 

  (setq enable-recursive-minibuffers t)

#+end_src
