config/optimisationsSansDeps.el

(global-hl-line-mode t)
(set-face-background hl-line-face "#311")

(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :custom    
  (doom-modeline-height 25)
  (doom-modeline-bar-width 1)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon t)
  (doom-modeline-major-mode-color-icon t)
  (doom-modeline-buffer-file-name-style 'truncate-upto-project)
  (doom-modeline-buffer-state-icon t)
  (doom-modeline-buffer-modification-icon t)
  (doom-modeline-minor-modes nil)
  ;;fait chauffer emacs, désactivé
  (doom-modeline-enable-word-count nil)
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-indent-info nil)
  (doom-modeline-checker-simple-format t)
  (doom-modeline-vcs-max-length 20)
  (doom-modeline-env-version t)
  (doom-modeline-irc-stylize 'identity)
  (doom-modeline-github-timer nil)
  (doom-modeline-gnus-timer nil)
  )

(use-package nyan-mode
  :config
  (nyan-mode)
  )

(use-package all-the-icons
  :init
  (unless (member "all-the-icons" (font-family-list))
    (all-the-icons-install-fonts t))
  :if (display-graphic-p)
  :config
  (unless (member "all-the-icons" (font-family-list))
    (all-the-icons-install-fonts t))
  )

;;pour les icônes dans dired
(use-package all-the-icons-dired)

(use-package doom-themes
  :config
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;; for treemacs
  (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)
  ;;load the theme
  (load-theme 'doom-moonlight t)
  )



;;charger le thème lors d'un client emacs :
(defvar display-theme-loadedp nil)
(defun load-display-theme ()
  (load-theme 'doom-moonlight t))
(add-hook 'after-make-frame-functions (lambda (frame)
                                        (unless display-theme-loadedp
                                          (with-selected-frame frame
                                            (load-display-theme))
                                          (setq display-theme-loadedp t))))

(defun mb/pick-color-theme (frame)
  (select-frame frame)
  (enable-theme 'doom-moonlight))
(add-hook 'after-make-frame-functions 'mb/pick-color-theme)

(use-package dimmer
  :custom
  (dimmer-fraction 0.3)
  (dimmer-exclusion-regexp-list
   '(".*Minibuf.*"
     ".*which-key.*"
     ".*LV.*"))
  :config
  (dimmer-mode 1)
  )

(setq enable-recursive-minibuffers t)
