config/optimisationsSansDeps.org
***** Vertico

Vertico provides a minimalistic vertical completion UI, which is based on the default completion system

#+begin_src emacs-lisp

  (use-package vertico

    ;;charger les extensions de vertico
    :load-path "straight/build/vertico/extensions"
    :custom
    (vertico-cycle t)
    :custom-face
    (vertico-current ((t (:background "#3a3f5a"))))
    :config


    ;; Prefix the current candidate with “» ”. From
    ;; https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
    (advice-add #'vertico--format-candidate :around
                (lambda (orig cand prefix suffix index _start)
                  (setq cand (funcall orig cand prefix suffix index _start))
                  (concat
                   (if (= vertico--index index)
                       (propertize "» " 'face 'vertico-current)
                     "  ")
                   cand)))





    ;;pour activer vertico directory (remonte d'un dossier à chaque fois, pratique ! )
    (require 'vertico-directory)
    ;; (define-key vertico-map [remap backward-kill-word] #'vertico-directory-up)
    ;; (define-key vertico-map [remap xah-delete-backward-char-or-bracket-text] #'vertico-directory-up)
    (define-key vertico-map [remap open-line] #'vertico-directory-up)
    ;; (define-key vertico-map [remap delete-backward-char] #'vertico-directory-up)

    ;; pour pouvoir jump à une entrée
    ;; (define-key vertico-map [remap avy-goto-char] #'vertico-quick-jump)

    (vertico-mode)

    )

#+end_src


***** Marginalia

Show document of function in =M-x=, or file attributes in C-x C-f
info sur le côté du mini buffer

#+begin_src emacs-lisp

  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode)
    )

#+end_src

***** Orderless

Use space-separated search terms in any order when completing with Icomplete or the default interface.
Exemple : M-x consult-line, taper "use ordeless", et vous tomberez sur use-package orderless
OVERCHEAT et je m'en sert tout le temps

#+begin_src emacs-lisp 

  ;; Complétation par candidats      
  ;; Use the `orderless' completion style.
  ;; Enable `partial-completion' for files to allow path expansion.
  ;; You may prefer to use `initials' instead of `partial-completion'.
  (use-package orderless
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion))))
    :config

    ;;couleur avec company
    (defun just-one-face (fn &rest args)
      (let ((orderless-match-faces [completions-common-part]))
        (apply fn args)))
    (advice-add 'company-capf--candidates :around #'just-one-face)

    )

#+end_src

***** Embark, pour faire des actions vraiment puissantes partout et sur tout

****** Moteur
 #+begin_src emacs-lisp
   (use-package embark
     :load-path "straight/build/embark"
     :bind (("C-t" . embark-become)) ;; pourquoi marche pas ?
     :config

     (setq embark-quit-after-action '((kill-buffer . t)
                                      (embark-insert . t)
                                      (embark-insert-in-outer-minibuffer . t)))

     ;; nouvelle commande pour insérer dans le minibuffer
     (defun embark-insert-in-outer-minibuffer (string)
       (if-let ((miniwin (active-minibuffer-window)))
           (with-current-buffer (window-buffer miniwin)
             (insert string))
         (message "Not in the minibuffer")))

     ;; (setf (alist-get 'embark-insert
     ;; embark-quit-after-action)
     ;; t)

     ;; (diredp-recent-dirs nil)
     (define-key embark-general-map "O" #'embark-insert-in-outer-minibuffer)

     ;; pour afficher avec which-key
     (defun embark-which-key-indicator ()
       "An embark indicator that displays keymaps using which-key.
                                                The which-key help message will show the type and value of the
                                                current target followed by an ellipsis if there are further
                                                targets."
       (lambda (&optional keymap targets prefix)
         (if (null keymap)
             (which-key--hide-popup-ignore-command)
           (which-key--show-keymap
            (if (eq (plist-get (car targets) :type) 'embark-become)
                "Become"
              (format "Act on %s '%s'%s"
                      (plist-get (car targets) :type)
                      (embark--truncate-target (plist-get (car targets) :target))
                      (if (cdr targets) "…" "")))
            (if prefix
                (pcase (lookup-key keymap prefix 'accept-default)
                  ((and (pred keymapp) km) km)
                  (_ (key-binding prefix 'accept-default)))
              keymap)
            nil nil t (lambda (binding)
                        (not (string-suffix-p "-argument" (cdr binding))))))))

     (setq embark-indicators
           '(embark-which-key-indicator
             embark-highlight-indicator
             embark-isearch-highlight-indicator))

     (defun embark-hide-which-key-indicator (fn &rest args)
       "Hide the which-key indicator immediately when using the completing-read prompter."
       (which-key--hide-popup-ignore-command)
       (let ((embark-indicators
              (remq #'embark-which-key-indicator embark-indicators)))
         (apply fn args)))

     (advice-add #'embark-completing-read-prompter :around #'embark-hide-which-key-indicator))

   (with-eval-after-load 'consult
     (with-eval-after-load 'embark
       (require 'embark-consult)))      ;; besoin de le load avec require. Pk ?
   (use-package embark-consult
     ;; :after consult embark
     ;; if you want to have consult previews as you move around an
     ;; auto-updating embark collect buffer
     :hook
     (embark-collect-mode . consult-preview-at-point-mode))

   ;; (with-eval-after-load 'org
   ;; (with-eval-after-load 'embark
   ;;     (require 'embark-org)))
   (load-file (concat straight-base-dir "straight/build/embark/embark-org.el"))
   (use-package embark-org
     ;; :load-path "straight/build/embark/"
     :straight nil)

   ;; ne sert à R ?
   (load-file (concat straight-base-dir "straight/repos/embark/avy-embark-collect.el"))
   (use-package avy-embark-collect
     ;; :load-path "straight/build/embark/"
     :straight nil)

   ;; actionner action embark dés l'arrivé avec . 
   (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark)

   (defun avy-action-embark (pt)
     (unwind-protect
         (save-excursion
           (goto-char pt)
           (embark-act))
       (select-window
        (cdr (ring-ref avy-ring 0))))
     t)

#+end_src

****** Redéfinition de ma fonction pour les lettres toujours au même endroit avec xah ?

#+begin_src emacs-lisp
#+end_src

****** Embark become (pour changer si je me trompe de commande)


#+begin_src emacs-lisp

  ;; (define-key embark-become-match-map (kbd (xah-fly--convert-kbd-str "h")) 'xah-fly-keys-layer-isearch-forward-function) ;; différent, plus petit dans les résultats ?
  (define-key embark-consult-search-map (kbd (xah-fly--convert-kbd-str "h")) 'xah-fly-keys-layer-isearch-forward-function)

  (define-key embark-become-file+buffer-map (kbd (xah-fly--convert-kbd-str "h"))
    'xah-fly-keys-layer-recentf-open-files-function)


  (define-key embark-become-help-map (kbd (xah-fly--convert-kbd-str "h"))
    'xah-fly-keys-layer-describe-variable-function)
#+end_src

****** Pour insérer directement les paths dans le minibuffer (plus utilisé, j'utilise la fonction dans ma config : embark-insert-in-outer-minibuffer)

#+begin_src emacs-lisp
  (use-package consult-dir
    :bind (("C-x C-d" . consult-dir)
           :map minibuffer-local-completion-map
           ("C-x C-d" . consult-dir)
           ("C-x C-j" . consult-dir-jump-file))
    :config
    ;; ne pas mettre un "/" quand on insère
    (setq consult-dir-shadow-filenames nil))
#+end_src

****** Compter le nombre de commandes pour embark

#+begin_src emacs-lisp
  (defvar action-counts (make-hash-table))

  (cl-defun increment-action-count (&key action &allow-other-keys)
    (cl-incf (gethash action action-counts 0)))

  (with-eval-after-load 'embark
    (push 'increment-action-count (alist-get :always embark-pre-action-hooks))
    )

#+end_src

****** Pour modifier/ajouter une touche à un keymap d'embark

#+begin_src emacs-lisp
  (define-key embark-symbol-map (kbd "=") 'set-variable)
#+end_src

