config/optimisationsSansDeps.org
**** Meilleur aide

#+begin_src emacs-lisp


  (use-package helpful  
    :config

    (with-eval-after-load 'xah-fly-keys
      ;; If you want to replace the default Emacs help keybindings, you can do so:

      ;; Note that the built-in `describe-function' includes both functions
      ;; and macros. `helpful-function' is functions only, so we provide
      ;; `helpful-callable' as a drop-in replacement.
      ;; (global-set-key (kbd "C-h f") #'helpful-callable)
      (define-key xah-fly-key-map [remap describe-function] #'helpful-callable)

      ;; (global-set-key (kbd "C-h v") #'helpful-variable)
      (define-key xah-fly-key-map [remap describe-variable] #'helpful-variable)


      ;; (global-set-key (kbd "C-h k") #'helpful-key)
      (define-key xah-fly-key-map [remap describe-key] #'helpful-key)

      ;; I also recommend the following keybindings to get the most out of helpful:

      ;; Lookup the current symbol at point. C-c C-d is a common keybinding
      ;; for this in lisp modes.
      (global-set-key (kbd "C-c C-d") #'helpful-at-point)

      ;; Look up *F*unctions (excludes macros).
      ;;
      ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
      ;; already links to the manual, if a function is referenced there.
      ;; (global-set-key (kbd "C-h F") #'helpful-function)

      ;; Look up *C*ommands.
      ;;
      ;; By default, C-h C is bound to describe `describe-coding-system'. I
      ;; don't find this very useful, but it's frequently useful to only
      ;; look at interactive functions.
      (define-key xah-fly-key-map [remap describe-coding-system] #'helpful-command)
      ;; (global-set-key (kbd "C-h C") #'helpful-command)
      )



    ;;meilleur gestion des fenêtres
    (setq helpful-switch-buffer-function #'+helpful-switch-to-buffer)

    (defun +helpful-switch-to-buffer (buffer-or-name)
      "Switch to helpful BUFFER-OR-NAME.

    The logic is simple, if we are currently in the helpful buffer,
    reuse it's window, otherwise create new one."
      (if (eq major-mode 'helpful-mode)
          (switch-to-buffer buffer-or-name)
        (pop-to-buffer buffer-or-name)))

    )


#+end_src
**** Window & Frame Management
***** Pour faire retour à la configuration de fenêtre précédente

“Undo”(and “redo”) changes in the window configuration with the key commands.
winner-undo and winner-redo

#+begin_src emacs-lisp 

  (winner-mode 1) ;;naviguer avec les fenêtres

#+end_src
***** Gestion des bookmarks classique
****** Encodage du fichier des bookmarks

#+begin_src emacs-lisp
  (setq bookmark-file-coding-system "utf-8-emacs")
#+end_src
***** Bookmark mais pour les fenêtre + frame

#+begin_src emacs-lisp
  (use-package burly
    :straight (burly :type git :host github :repo "alphapapa/burly.el"
                     :fork (:host github
                                  :repo "alphapapa/burly.el"))

    :config
    ;; 'nouveaunom #'anciennom, anciennomexisteencore
    ;; (defalias 'bookmark-windows-burly #'burly-bookmark-windows)
    ;; (defalias 'bookmark-windows-and-frames-burly #'burly-bookmark-frames)
    ;; j'ai gardé et mis directement sur LayerXahFlyKey
    )
#+end_src
***** Buffer temporaires dans une autre frame (dont scratch au démarrage)
#+begin_src emacs-lisp
  ;; (when window-system (setq pop-up-frames t))
#+end_src

***** Gestion de la double fenêtre au démarrage

****** Variable des fenêtres

Configurer juste "size-frame-width"

#+begin_src emacs-lisp

  (defvar display-pixel-width (display-pixel-width) "Width of DISPLAY’s screen in pixels.")
  (defvar display-pixel-height (display-pixel-height) "Height of DISPLAY’s screen in pixels.")

  (defvar size-frame-width nil "Where place the frame in x")
  (setq size-frame-width (truncate (/ display-pixel-width 2.25))) ;; only this need to be configure
  (defvar size-frame-height display-pixel-height "Where place the frame in x")
  (defvar size-frame-shift (/ (- (/ display-pixel-width 2) size-frame-width) 2) "Size of the shift to center the windows")
  (defvar place-frame-x (+ (/ display-pixel-width 2) size-frame-shift) "Where place the frame in x")
  (defvar place-frame-y display-pixel-height "Where place the frame in x")

  (setq frame-resize-pixelwise t) ;; sinon je ne peux pas dépasser 1050 en hauteur

#+end_src

****** Pour lancer la fenêtre sur le côté au démarrage

#+begin_src emacs-lisp

  (defun cp/frame-place-default ()
    "Place the frame to the default place"
    (set-frame-size (selected-frame) size-frame-width display-pixel-height t)
    (set-frame-position (selected-frame) place-frame-x place-frame-y))

  (when window-system
    (cp/frame-place-default))

#+end_src

****** Pour que chaque nouvelle fenêtre soit une fois à droite une fois à gauche

#+begin_src emacs-lisp

  (defun cp/position-of-new-windows ()
    (if (and window-system (get 'cp/position-of-new-windows 'state))
        (progn
          (cp/frame-place-default)
          (put 'cp/position-of-new-windows 'state nil))
      (progn
        (set-frame-size (selected-frame) size-frame-width display-pixel-height t)
        (set-frame-position (selected-frame) size-frame-shift place-frame-y) ;; on décale juste la fenêtre en partant de 0
        (put 'cp/position-of-new-windows 'state t))))

  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (select-frame frame)
              (when (display-graphic-p frame)
                (cp/position-of-new-windows))))

#+end_src

****** Pour lancer deux fenêtre au démarrage, mais ne fait plus fonctionner org-icalendar-combine-agenda-files-background

#+begin_src emacs-lisp

  ;; (make-frame)

#+end_src

**** Démarrer avec les fichiers récents, titre etc

Dépendances : all-the-icons et projectile

#+begin_src emacs-lisp :tangle no

  (use-package dashboard
    :after all-the-icons
    :config
    ;;centrer le dashboard
    (setq dashboard-center-content t)
    ;;item
    (setq dashboard-items '(
                            (recents  . 10)			    
                            (agenda . 5)
                            (bookmarks . 5)
                            ;; (projects . 5) 
                            (registers . 5)
                            )
          )
    ;;si il y a projectile
    (with-eval-after-load 'projectile ;;important
      (setq dashboard-items '(
                              (recents  . 10)			    
                              (agenda . 5)
                              (bookmarks . 5)
                              (projects . 5) 
                              (registers . 5)
                              )
            )
      )

    ;;agenda de la semaine 
    (setq dashboard-week-agenda t)
    ;;emacsclient avec dashboard, enlever plus besoin mais gardé au cas où
    ;; (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
    (dashboard-setup-startup-hook)
    )

#+end_src


***** Ace windows (à supprimer ?)

#+begin_src emacs-lisp
    (use-package ace-window
    :config
  (setq aw-keys '(?a ?u ?e ?i ?t ?s ?r ?n ?\ ))  )
#+end_src

**** Completion

***** TODO Corfu
:LOGBOOK:
- State "TODO"       from              [2023-02-13 Mon 20:54]
:END:

#+begin_src emacs-lisp :tangle no

  ;; (require 'cl)
  ;; (require 'cl-macs)

  ;; besoin de cette fonction qui n'est pas chargé
  (defmacro cl-with-gensyms (names &rest body)
    "Bind each of NAMES to an uninterned symbol and evaluate BODY."
    (declare (debug (sexp body)) (indent 1))
    `(let ,(cl-loop for name in names collect
                    `(,name (gensym (symbol-name ',name))))
       ,@body))

  (use-package corfu
    ;; TAB-and-Go customizations
    :custom
    (corfu-cycle t)           ;; Enable cycling for `corfu-next/previous'
    (corfu-preselect 'prompt) ;; Always preselect the prompt

    ;; Use TAB for cycling, default is `corfu-complete'.
    :bind
    (:map corfu-map
          ("TAB" . corfu-next)
          ([tab] . corfu-next)
          ("S-TAB" . corfu-previous)
          ([backtab] . corfu-previous))

    :init
    (global-corfu-mode)
    :config
    ;; Enable auto completion and configure quitting
    (setq corfu-auto t
          corfu-quit-no-match 'separator) ;; or t
    )


  ;; A few more useful configurations...
  (use-package emacs
    :init
    ;; TAB cycle if there are only few candidates
    (setq completion-cycle-threshold 3)

    ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
    ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
    ;; (setq read-extended-command-predicate
    ;;       #'command-completion-default-include-p)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (setq tab-always-indent 'complete))

#+end_src

***** TODO Company (déplacer ici)
:LOGBOOK:
- State "TODO"       from              [2023-02-13 Mon 20:54]
:END:
* File Manager (dired)
*** Optimisation de base

#+begin_src emacs-lisp

  ;;pour supprimer directement le buffer si un fichier est supprimé (ou directory)
  (defun my--dired-kill-before-delete (file &rest rest)
    (if-let ((buf (get-file-buffer file)))
        (kill-buffer buf)
      (dolist (dired-buf (dired-buffers-for-dir file))
        (kill-buffer dired-buf))))
  (advice-add 'dired-delete-file :before 'my--dired-kill-before-delete)

  ;; auto refresh dired when file changes
  (add-hook 'dired-mode-hook 'auto-revert-mode)

  (setq dired-auto-revert-buffer t) ;; Refreshes the dired buffer upon revisiting
  (setq dired-dwim-target t) ;; If two dired buffers are open, save in the other when trying to copy
  (setq dired-hide-details-hide-symlink-targets nil) ;; Don't hide symlink targets
  (setq dired-listing-switches "-alh") ;; Have dired view all folders, in lengty format, with data amounts in human readable format
  (setq dired-ls-F-marks-symlinks nil) ;; Informs dired about how 'ls -lF' marks symbolic links, see help page for more details
  (setq dired-recursive-copies 'always) ;; Always copy recursively without asking
  (setq dired-recursive-deletes 'always) ; demande plus pour supprimer récursivement
  (setq dired-dwim-target t) ; qd t-on copie, si un autre dired ouvert, copie dans lui "directement"

#+end_src
*** Trier avec S dans dired

#+begin_src emacs-lisp

  (use-package dired-quick-sort
    :config
    (dired-quick-sort-setup)
    )

#+end_src
*** Quand un fichier dans un dossier, le montre direct

#+begin_src emacs-lisp

  (use-package dired-collapse
    :defer t)
  (add-hook 'dired-load-hook
	    (lambda ()
	      (interactive)
	      (dired-collapse)))

#+end_src
