config/optimisationsSansDeps.el

(use-package helpful  
  :config

  ;; If you want to replace the default Emacs help keybindings, you can do so:

  ;; Note that the built-in `describe-function' includes both functions
  ;; and macros. `helpful-function' is functions only, so we provide
  ;; `helpful-callable' as a drop-in replacement.
  ;; (global-set-key (kbd "C-h f") #'helpful-callable)
  (define-key xah-fly-key-map [remap describe-function] #'helpful-callable)

  ;; (global-set-key (kbd "C-h v") #'helpful-variable)
  (define-key xah-fly-key-map [remap describe-variable] #'helpful-variable)


  ;; (global-set-key (kbd "C-h k") #'helpful-key)
  (define-key xah-fly-key-map [remap describe-key] #'helpful-key)

  ;; I also recommend the following keybindings to get the most out of helpful:

  ;; Lookup the current symbol at point. C-c C-d is a common keybinding
  ;; for this in lisp modes.
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)

  ;; Look up *F*unctions (excludes macros).
  ;;
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  ;; (global-set-key (kbd "C-h F") #'helpful-function)

  ;; Look up *C*ommands.
  ;;
  ;; By default, C-h C is bound to describe `describe-coding-system'. I
  ;; don't find this very useful, but it's frequently useful to only
  ;; look at interactive functions.
  (define-key xah-fly-key-map [remap describe-coding-system] #'helpful-command)
  ;; (global-set-key (kbd "C-h C") #'helpful-command)




  ;;meilleur gestion des fenêtres
  (setq helpful-switch-buffer-function #'+helpful-switch-to-buffer)

  (defun +helpful-switch-to-buffer (buffer-or-name)
    "Switch to helpful BUFFER-OR-NAME.

The logic is simple, if we are currently in the helpful buffer,
reuse it's window, otherwise create new one."
    (if (eq major-mode 'helpful-mode)
        (switch-to-buffer buffer-or-name)
      (pop-to-buffer buffer-or-name)))

  )

(winner-mode 1) ;;naviguer avec les fenêtres

(use-package burly
  :straight (burly :type git :host github :repo "alphapapa/burly.el"
                   :fork (:host github
                                :repo "alphapapa/burly.el"))

  :config
  ;; 'nouveaunom #'anciennom, anciennomexisteencore
  ;; (defalias 'bookmark-windows-burly #'burly-bookmark-windows)
  ;; (defalias 'bookmark-windows-and-frames-burly #'burly-bookmark-frames)
  ;; j'ai gardé et mis directement sur LayerXahFlyKey
  )

(defun cp/position-of-new-windows ()
  (if (and window-system (get 'cp/position-of-new-windows 'state))
      (progn
        (set-frame-position (selected-frame) 50 0)
        (set-frame-size (selected-frame) 91 63)
        (put 'cp/position-of-new-windows 'state nil)
        )
    (progn
      (set-frame-position (selected-frame) 1050 0)
      (set-frame-size (selected-frame) 91 63)
      (put 'cp/position-of-new-windows 'state t)
      )
    )
  )

(add-hook 'after-make-frame-functions
          (lambda (frame)
            (select-frame frame)
            (when (display-graphic-p frame)
              (cp/position-of-new-windows))))

(cp/position-of-new-windows)

(when window-system
  (set-frame-position (selected-frame) 1050 0)
  (set-frame-size (selected-frame) 91 63))

;; (make-frame)

;; (when window-system (setq pop-up-frames t))

;;pour supprimer directement le buffer si un fichier est supprimé (ou directory)
(defun my--dired-kill-before-delete (file &rest rest)
  (if-let ((buf (get-file-buffer file)))
      (kill-buffer buf)
    (dolist (dired-buf (dired-buffers-for-dir file))
      (kill-buffer dired-buf))))
(advice-add 'dired-delete-file :before 'my--dired-kill-before-delete)

;; auto refresh dired when file changes
(add-hook 'dired-mode-hook 'auto-revert-mode)

(setq dired-auto-revert-buffer t) ;; Refreshes the dired buffer upon revisiting
(setq dired-dwim-target t) ;; If two dired buffers are open, save in the other when trying to copy
(setq dired-hide-details-hide-symlink-targets nil) ;; Don't hide symlink targets
(setq dired-listing-switches "-alh") ;; Have dired view all folders, in lengty format, with data amounts in human readable format
(setq dired-ls-F-marks-symlinks nil) ;; Informs dired about how 'ls -lF' marks symbolic links, see help page for more details
(setq dired-recursive-copies 'always) ;; Always copy recursively without asking
(setq dired-recursive-deletes 'always) ; demande plus pour supprimer récursivement
(setq dired-dwim-target t) ; qd t-on copie, si un autre dired ouvert, copie dans lui "directement"

(use-package dired-quick-sort
  :config
  (dired-quick-sort-setup)
  )

(use-package dired-collapse
  :defer t)
(add-hook 'dired-load-hook
	  (lambda ()
	    (interactive)
	    (dired-collapse)))
