config/optimisationsSansDeps.el

(setq dired-omit-files
      (rx (or
           (seq bol (? ".") "#")
           (seq bol "." eol)
           (seq bol ".." eol)
           )))

(add-hook 'dired-mode-hook
          (lambda ()
            (interactive)
            ;; (dired-omit-mode 1)
            (all-the-icons-dired-mode 1)
            (dired-sort-toggle-or-edit)
            (dired-hide-details-mode)
            (hl-line-mode 1)
            ))

(eval-after-load "dired-aux"
  '(add-to-list 'dired-compress-file-suffixes 
                '("\\.zip\\'" ".zip" "unzip")))

(eval-after-load "dired"
  '(define-key dired-mode-map "z" 'dired-zip-files))
(defun dired-zip-files (zip-file)
  "Create an archive containing the marked files."
  (interactive "sEnter name of zip file: ")

  ;; create the zip file
  (let ((zip-file (if (string-match ".zip$" zip-file) zip-file (concat zip-file ".zip"))))
    (shell-command 
     (concat "zip " 
             zip-file
             " "
             (concat-string-list 
              (mapcar
               #'(lambda (filename)
                   (file-name-nondirectory filename))
               (dired-get-marked-files))))))
  (revert-buffer)

  ;; remove the mark on all the files  "*" to " "
  ;; (dired-change-marks 42 ?\040)
  ;; mark zip file
  ;; (dired-mark-files-regexp (filename-to-regexp zip-file))
  )



(defun concat-string-list (list) 
  "Return a string which is a concatenation of all elements of the list separated by spaces" 
  (mapconcat #'(lambda (obj) (format "%s" obj)) list " "))

(defun rename-file-and-buffer (new-name)
  "Renames both current buffer and file it's visiting to NEW-NAME."
  (interactive "sNew name: ")
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil))))))

;; (rename-file-and-buffer (concat "../liens/" (file-name-nondirectory buffer-file-name)))

(use-package restart-emacs
    :config (defalias 'emacs-restart #'restart-emacs)
    )

(use-package magit)

(setq cp/magit-commit-directory-list '(
                                       braindump-directory
                                       ;; "~/test/"
                                       ))

(defun cp/magit-commit-directory-list(list)
  "prends une liste représentant les directory à commit"
  (dolist (directory list)
    (cp/magit-commit-directory directory))
  )

(defun cp/magit-commit-directory(directory)
  (interactive)
  (save-window-excursion
    (find-file
     (if (stringp directory) ;; à cause du do-list
         directory
       (symbol-value directory)
       )
     )
    (magit-call-git "add" ".")
    (magit-call-git "commit" "-m" "Auto commit")
    (magit-refresh)
    (message "Commit fait pour le dossier : %s" directory)
    )
  )

(cp/magit-commit-directory-list cp/magit-commit-directory-list)

(add-hook 'kill-emacs-hook #'(lambda () (cp/magit-commit-directory-list cp/magit-commit-directory-list)) 95) ;; doit commit à la fin

;; (remove-hook 'kill-emacs-hook #'(lambda () (cp/magit-commit-directory-list cp/magit-commit-directory-list)) )

(use-package nov
    :config
    (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))

(use-package pdf-tools
  :if (not termux-p)
  :config
  ;; initialise
  (pdf-tools-install t)
  ;; open pdfs scaled to fit page
  (setq-default pdf-view-display-size 'fit-page)
  ;; automatically annotate highlights
  (setq pdf-annot-activate-created-annotations t)
  ;; use normal isearch
  (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
  ;;mode nuit de base
  (add-hook 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode)
  )

(use-package engine-mode
         :straight t
         :config
         (engine-mode t)
         (defengine duckduckgo "https://duckduckgo.com/?q=%s" :keybinding "d")
         (defengine ecosia "https://www.ecosia.org/search?q=%s" :keybinding "e")
         (defengine google "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s" :keybinding "g")
         (defengine lilo "https://search.lilo.org/results.php?q=%s" :keybinding "l")
         (defengine qwant "https://www.qwant.com/?q=%s" :keybinding "q")
         (defengine wikipedia "http://www.wikipedia.org/search-redirect.php?language=fr&go=Go&search=%s" :keybinding "w")
         (defengine youtube "http://www.youtube.com/results?aq=f&oq=&search_query=%s" :keybinding "y"))
