config/optimisationsSansDeps.el

(use-package newsticker
  :ensure nil
  :custom
  (newsticker-url-list-defaults nil)
  (newsticker-url-list '(
                         ;; ("title" "URL" other options)
                         ("SécuMondeInfo" "https://www.lemondeinformatique.fr/flux-rss/thematique/internet/rss.xml") 
                         ("AnsiSécu" "https://www.ssi.gouv.fr/feed/actualite/")
                         ("MondeInter" "http://www.lemonde.fr/international/rss_full.xml")
                         ("SimonPuech" "https://www.youtube.com/feeds/videos.xml?channel_id=LeJeuVidéal")
                         ("FuturaEspace" "https://www.futura-sciences.com/rss/espace/actualites.xml")
                         ("EmacsLife" "https://planet.emacslife.com/")
                         ;; ("Reddit - Org-mode" "https://www.reddit.com/r/orgmode.rss")
                         ))

  ;; (newsticker-groups nil)
  (add-hook 'newsticker-mode-hook 'imenu-add-menubar-index)
  ;; (newsticker-new-item-functions '(newsticker-download-images newsticker-download-enclosures))
  ;; (newsticker-new-item-functions nil)

  :config

  ;; pour maj, corrigé dans les dernières versions d'emacs
  (defun newsticker--treeview-list-items-with-age (&rest ages)
    "Actually fill newsticker treeview list window with items of certain age.
    AGES is the list of ages that are to be shown."
    (mapc (lambda (feed)
            (let ((feed-name-symbol (intern (car feed))))
              (mapc (lambda (item)
                      (when (or (memq 'all ages)
                                (memq (newsticker--age item) ages))
                        (newsticker--treeview-list-add-item
                         item feed-name-symbol t)))
                    (newsticker--treeview-list-sort-items
                     (cdr (newsticker--cache-get-feed feed-name-symbol))))))
          (append newsticker-url-list-defaults newsticker-url-list))
    (newsticker--treeview-list-update nil))

  (defun newsticker-treeview-update ()
    "Update all treeview buffers and windows.
  Note: does not update the layout."
    (interactive)
    (let ((cur-item (newsticker--treeview-get-selected-item)))
      (if (newsticker--group-manage-orphan-feeds)
          (newsticker--treeview-tree-update))
      (newsticker--treeview-list-update t)
      (newsticker--treeview-item-update)
      (newsticker--treeview-tree-update-tags)
      (cond (newsticker--treeview-current-vfeed
             (newsticker--treeview-list-items-with-age
              (intern newsticker--treeview-current-vfeed)))
            (newsticker--treeview-current-feed
             (newsticker--treeview-list-items newsticker--treeview-current-feed)))
      (newsticker--treeview-tree-update-highlight)
      (newsticker--treeview-list-update-highlight)
      (let ((cur-feed (or newsticker--treeview-current-feed
                          newsticker--treeview-current-vfeed)))
        (if (and cur-feed cur-item)
            (newsticker--treeview-list-select cur-item)))))


  )

(use-package elfeed
  :config

  (setq elfeed-feeds
        '(("http://nullprogram.com/feed/" blog emacs)
          "http://www.50ply.com/atom.xml"  ; no autotagging
          ("http://nedroid.com/feed/" webcomic)))

  (setq elfeed-feeds nil)

  ;;touche v pour voir une vidéo
  (defun elfeed-v-mpv (url)
    "Watch a video from URL in MPV"
    (async-shell-command (format "mpv %s" url)))

  (defun elfeed-view-mpv (&optional use-generic-p)
    "Youtube-feed link"
    (interactive "P")
    (let ((entries (elfeed-search-selected)))
      (cl-loop for entry in entries
               do (elfeed-untag entry 'unread)
               when (elfeed-entry-link entry)
               do (elfeed-v-mpv it))
      (mapc #'elfeed-search-update-entry entries)
      (unless (use-region-p) (forward-line))))

  (define-key elfeed-search-mode-map (kbd "v") 'elfeed-view-mpv)

  )

(use-package elfeed-org
  :after elfeed
  :config

  (setq rmh-elfeed-org-files (list (concat config-directory "org-elfeed/org-elfeed.org")))
  (setq cp/rmh-elfeed-org-files-output (concat config-directory "org-elfeed/org-elfeed.opml"))

  ;; (cp/elfeed-org-export-opml-with-output)

  ;;pour la ranger dans un fichier
  (defun cp/elfeed-org-export-opml-with-output ()
    "Export Org feeds under `rmh-elfeed-org-files' to a temporary OPML buffer.
        The first level elfeed node will be ignored. The user may need edit the output
        because most of Feed/RSS readers only support trees of 2 levels deep."
    (interactive)
    (let ((opml-body (cl-loop for org-file in rmh-elfeed-org-files
                              concat (rmh-elfeed-org-convert-org-to-opml
                                      (find-file-noselect (expand-file-name org-file))))))

      (save-window-excursion
        (find-file cp/rmh-elfeed-org-files-output)
        (erase-buffer)
        (insert "<?xml version=\"1.0\"?>\n")
        (insert "<opml version=\"1.0\">\n")
        (insert "  <head>\n")
        (insert "    <title>Elfeed-Org Export</title>\n")
        (insert "  </head>\n")
        (insert "  <body>\n")
        (insert opml-body)
        (insert "  </body>\n")
        (insert "</opml>\n")
        (save-buffer)
        )
      ))




  ;; (elfeed-db-unload) ;; à appeler après avoir modifier la database
  ;; (delete-directory "/home/utilisateur/.emacs.d/var/elfeed/db/" t t)
  ;; (elfeed-db-unload)
  ;; (elfeed-db-gc)

  (elfeed-load-opml cp/rmh-elfeed-org-files-output)
  (elfeed-update)

  )

(use-package elfeed-goodies
  :after elfeed
  :config 
  (elfeed-goodies/setup))
